           TESTSUITE 'Test OHCE Kata'

      *>    TESTCASE 'Reversing works (5 char)'
      *>    MOVE 'ABCDE' TO ORIGINAL
      *>    PERFORM DO-REVERSE
      *>    EXPECT REVD TO BE "EDCBA"
         